using System;

namespace HW24
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               1.	Static методы Ц используютс€ дл€ того, чтобы обращатьс€ к ним на уровне класса.

               2.	ћетод extension Ц метод расширени€ позвол€ют "добавл€ть" методы в существующие типы
                    без создани€ нового производного типа, перекомпил€ции и иного изменени€ первоначального типа.
                    ћетоды расширени€ представл€ют собой разновидность статического метода, но вызываютс€ так же,
                    как методы экземпл€ра в расширенном типе.
            
               3.	ћетод в €зыке C# это блок кода, содержащий р€д инструкций. ѕрограмма инициирует выполнение инструкций,
                    вызыва€ метод и указыва€ все аргументы, необходимые дл€ этого метода. ¬ C# все инструкции
                    выполн€ютс€ в контексте метода

            */
        }
    }
}