using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task5OperatorsArray
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //  Создать класс представляющий массив
            //  Объекты такого класса можно складывать, вычитать, умножать, делить, брать остаток от деления
            //  В результате работы этих операций должен возвращаться новый такой массив.
            //  Если массивы разной длины, то возвращаться должен новы   массив с длинной большего из них.
            //  (Над лишними элементами операции не выполняются - они просто помещаются в новый массив)
            //  Написать метод Print, выводящий на консоль все элементы массива.
        }
    }
}
