using System;

namespace HW08
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
            
            1.	Чтотакое переменная?
            
            Переменная – это область памяти, в которой хранится значения определенного типа. 
            

            2. Как не могут обозначаться переменные?	
            
            Переменные не могут обозначаться только цифрами, не могут иметь в своем имени пробел, 
            знаки пунктуации, а также скобки и специальные символы. Имя переменной не может начинаться с цифры,
            или совпадать с ключевым словом языка.


            3.	Что такое литералы?
            
            Литералы – это неизменяемые значения определенного типа, они могут быть строковыми, целочисленными,
            вещественными, символьными, логическими. 


            */
        }
    }
}