using System;

namespace HW07
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
            
            1. Что такое breakpoint?

            Breakpoint – точка в которой выполнение программы приостанавливается,
            и становится возможным ее пошаговое выполнение.


            2. Что такое debugger?

            Debugger – выполнение программы с просмотром значений параметров и заходом в методы


            3. Для чего это нужно?

            Это необходимо для того, чтобы найти ошибки в выполняемом коде.
            Ошибки которые трудно или невозможно обнаружить в процессе обычного выполнения программы.


            */
        }
    }
}