using System;

namespace HW23
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               1.	»нкапсул€ци€ - это заключение данных и функциональности в оболочку.
                    ¬ объектно-ориентированном программировании в роли оболочки выступают классы:
                    они не только собирают переменные и методы в одном месте, но и защищают их от вмешательства извне.

               2.	—уществуют классы инкапсул€ции написанные умными д€дьками, и их можно использовать в своей работе
                    в качестве Ђдеталей конструктораї. “акже можно писать свои классы с той же целью.

               3.	ќбъектно-ориентированное программирование Ц это методологи€ программировани€,
                    основанна€ на представлении программы в виде совокупности взаимодействующих объектов,
                    каждый из которых €вл€етс€ экземпл€ром определЄнного класса, а классы образуют иерархию наследовани€.

            */
        }
    }
}