using System;

namespace HW06
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
              
            1.	Что такое теги?
            
            Теги это элементы языка xml, ключевые слова, используются для удобной документации кода.
            

            2.	Перечислите их, и опишите их свойства
            
            <summary> – самый главный тег, отображает сведения о типе или элементе. 
            <remarks> – отображает дополнительные сведения.
            <returns> -  используется в комментариях к объявлению метода для описания возвращаемого значения.
            <value> - позволяет описывать значение, которое представляется свойством. 
            <para> – разделяет текст на параграфы, для более удобного чтения
            <c> – используется для того, чтобы представлять участки текста в виде кода
            <exception> – показывает, что метод может выбрасывать исключения
            <params> -  используется в комментариях к объявлению метода для описания одного из параметров такого метода. 
            <typeparam> - использовать в комментариях к объявлению универсального типа или метода для описания параметра типа. 
            <paramref> – используется для создания ссылки на параметр.
            <list> -  служит для вывода в виде списка, для лучшей читаемости документации
            <inheritdoc> -  позволяет обойтись без копирования и вставки одинаковых XML-комментариев и автоматически
            поддерживать их синхронизацию.

            */
        }
    }
}