using System;

namespace HW32
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               Индексатор позволяет индексировать экземпляр класса или структуры как массив. Если пользователь определит
               индексатор для класса, то класс будет вести себя как виртуальный массив. Пользователь может получить или
               задать индексированное значение, не указывая экземпляр или элемент типа.

            */
        }
    }
}