using System;

namespace HW22
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               1.	Stack Ц это небольша€ область в пам€ти дл€ быстрой работы с данными. 
                    Heap Ц это больша€ область дл€ хранени€ данных.

               2.	Stack используетс€ дл€ хранени€ переменных, выполнени€ операций и дл€ вызова методов,
                    определ€ет очередность их вызова. ћало, но быстро.

               3.	Heap используетс€ дл€ хранени€ данных. ƒанные лежат не упор€дочено. ћного, но медленно.
            
               4.	«начимый тип размещаетс€ в Stack, это struct, enum , int, bool.
            
               5.	—сылочный тип размещаетс€ в Heap, это object, class, string, интерфейсы и делегаты.

            */
        }
    }
}