using System;

namespace HW37
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               1.   јнонимный метод безым€нный кодовый блок, который передаетс€ конструктору делегата.
                    Ќе нужно объ€вл€ть отдельный метод, только дл€ того, чтобы передать его делегату.

               2.	Ћ€мбда выражение Ц более компактное представление анонимного метода.
            
               3.	—ходства Ц работают одинаково, различие в синтаксисе


            */
        }
    }
}