using System;

namespace HW01
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
             * 
            1.За что отвечает Xamarin?

            Xamarin – framework, предназначенный для мобильной разработки.Приложения для iOS и Android.


            2.Как происходит процесс исполнения приложения?

            Написанный код C# компилируется в промежуточный (CIL), далее в JIT, с использованием кэша.
            А затем исполняется операционной системой.


            3.Что такое.NET?

            Платформа для разработки программного обеспечения с открытым кодом.

            */

        }
    }
}