using System;

namespace HW25
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               1.	Наследование это - это механизм базирования объекта или класса на другом объекте
                    (наследование на основе прототипа) или классе (наследование на основе класса) с сохранением
                    аналогичной реализации. Также определяется как получение новых классов (подклассов) из базовых классов,
                    а затем формирование их в иерархию классов.

               2.	Класс protected – а точнее модификатор доступа позволяет получить доступ к защищенному элементу
                    из соответствующего класса, а также экземплярами производных классов.

               3.	Ссылочный тип это тип, которые наследуют тип System.Object,
                    то есть class, interface, delegate, string. Object также является ссылочным типом,
                    но он не наследует System.Object, а является этим типом. Указатель или ссылка– это то,
                    что связывает определенный тип с его значением в памяти. Указатель может находиться в стеке или в куче,
                    но указывает на определенное место в куче.

            */
        }
    }
}