using System;

namespace HW34
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               1.	¬се операторы €зыка —#: 
                    јрифметические операторы, выполн€ющие арифметические операции с числовыми операндами.
                    ќператоры сравнени€, сравнивающие числовые операнды.
                    Ћогические операторы, выполн€ющие логические операции с операндами bool.
                    Ѕитовые операторы и операторы сдвига выполн€ют битовые операции или операции сдвига с операндами
                    целочисленных типов.
                    ќператоры равенства провер€ют равенство или неравенство своих операндов.

               2.	ќперанд Ц элемент с которым производитс€ операци€

               3.	”нарна€ операци€, операци€, котора€ производитс€ с одним операндом, например инкремент (i++)

               4.	Ѕинарна€ операци€ производитс€ с двум€ операндами, например сложение (a + b)

               5.	“ернарный оператор (?:), вычисл€ет логическое выражение и в зависимости от полученного значени€
                    true или false возвращает результат одного из двух соответствующих выражений

               6.	¬ общем виде сигнатура перегрузки оператора выгл€дит следующим образом:
                    Public static //класс// operator //оператор который перегружаем// (//класс левый операнд//, //класс правый операнд//)
                    { return new //класс// (операци€); } 

            */
        }
    }
}