using System;

namespace HW36
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               Делегат -  это тип, который представляет ссылки на методы со списком параметров и типом возвращаемого значения.

               Делегаты используются для передачи методов в качестве аргументов к другим методам.

               Делегату можно назначить любой метод из любого доступного класса или структуры, соответствующей типу делегата.
               Этот метод должен быть статическим методом или методом экземпляра. Такая гибкость позволяет программно изменять
               вызовы метода, а также включать новый код в существующие классы. 

            */
        }
    }
}