using System;

namespace HW46
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               1.	Динамические запросы и выражения работают следующим образом: запрос представляет собой выражение,
                    извлекающее данные из источника данных. Запросы обычно выражаются на специализированном языке запросов.
                    LINQ упрощает ситуацию, реализуя согласованную модель работы с данными для различных типов источников
                    и форматов данных.   

               2.	Linq (Language Integrated Query) –  механизм запросов, встроенный в язык программирования C#.
                    Он служит для облегчения операций с коллекциями, которые представляются в виде объектов в .NET Framework.
                    Они могут быть представлены в виде объектов, реляционных баз данных или других источников данных.

               3.	Преимущества: Декларативный подход делает запросы более понятными и компактными

               4.	Выражения запросов понимаются недостаточно хорошо и используются чрезмерно.
                    Часто простой вызов метода является более коротким и простым. 

            */
        }
    }
}