using System;

namespace HW21
{
    class Program
    {
        static void Main(string[] args)
        {
            /* 
               
               1.Stack – это абстрактный тип данных, представляющий собой список элементов,
               организованных по принципу LIFO (англ. last in — first out, «последним пришёл — первым вышел»).

               2.Heap – это структура данных, с помощью которой реализована динамически распределяемая память приложения.

               3.Принципиальное отличие Stack от Heap, в том, что при меньшем размере Stack работает гораздо быстрее.
               Существует ограничение в том, что данные, которые предполагается хранить в Stack,
               обязаны быть конечными и статичными — их размер должен быть известен ещё на этапе компиляции.
               Типичные структуры данных, которые хранятся в Heap — это глобальные переменные,
               они должны быть доступны для разных потоков приложения, ссылочные типы, такие как
               строки или ассоциативные массивы, а так же другие сложные структуры данных.

            */
        }
    }
}